Fitness/myapp/app/controllers/meals_controller.rb

  def create
    @meal = Meal.new(meal_params)
    @meal.save
---
INSERT INTO "meals" ("name", "content", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["name", "s"], ["content", "s"], ["created_at", "2019-08-29 14:04:18.355482"], ["updated_at", "2019-08-29 14:04:18.355482"], ["image", "IMG_3271.jpg"]]

  def show
    @meal = Meal.find(params[:id])
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @meal = Meal.find(params[:id])
    @meal.destroy
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 6]]