Fitness/myapp/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "yama"], ["email", "yama14yama0823@gmail.com"], ["password_digest", "yama"], ["created_at", "2019-08-31 15:28:18.549030"], ["updated_at", "2019-08-31 15:28:18.549030"]]
---
    def create
        @user = User.new(user_params)
        @user.save